clc; clear;

 %Προσομοίωση Monte Carlo για σωματίδια σε χώρο 1Δ και τυχαία κίνηση αριστερά-δεξιά
 %Random Walks - Monte Carlo
 
for n=1:100000              %Δημιουργία 100000 σωματιδίων
     thesi(n)=0;            %Αρχική θέση σωματιδίων (αρχή των αξόνων)
       for i=1:10           %Δημιουργία 10 βημάτων για ένα σωματίδιο
          x=rand();         %Γέννηση ψευδοτυχαίου αριθμού για τη φορά κίνησης σε κάθε βήμα
                 if x<0.5 
                    thesi(n)=thesi(n)-0.5;    %Κίνηση προς την αρνητική φορά του άξονα x
                 elseif x>=0.5
                    thesi(n)=thesi(n)+0.5;    %Κίνηση προς την θετική φορά του άξονα x
                 end
           i=i+1;
       end
      n=n+1;
end

histogram(thesi) %Δημιουργία ιστογράμματος (αριθμός σωματιδίων - τελική θέση σωματιδίων)
title('Random Walks - Monte Carlo');
xlabel('Displacement x');
ylabel('Number of particles');

hold on
for n=1:100000               %Δημιουργία 100000 σωματιδίων
     thesi2(n)=0;            %Αρχική θέση σωματιδίων (αρχή των αξόνων)
       for i=1:100           %Δημιουργία 100 βημάτων για ένα σωματίδιο
          x=rand();          %Γέννηση ψευδοτυχαίου αριθμού για τη φορά κίνησης σε κάθε βήμα
                 if x<0.5 
                    thesi2(n)=thesi2(n)-0.5;    %Κίνηση προς την αρνητική φορά του άξονα x
                 elseif x>=0.5
                    thesi2(n)=thesi2(n)+0.5;    %Κίνηση προς την θετική φορά του άξονα x
                 end
           i=i+1;
       end
      n=n+1;
end
histogram(thesi2) %Συμπλήρωση ιστογράμματος 
legend('10 random moves/particle','100 random moves/particle');